Revit 2027 API
AssetPropertyList.InsertNewAssetPropertyDouble Method
 Inserts a new AssetPropertyDouble containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void InsertNewAssetPropertyDouble(
	double value,
	int index
)
Public Sub InsertNewAssetPropertyDouble (
	value As Double,
	index As Integer
)
public:
void InsertNewAssetPropertyDouble(
	double value,
	int index
)
member InsertNewAssetPropertyDouble :
        value : float *
        index : int -> unit
Parameters
value Double
 The double value to insert.
index Int32
 An integer index.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace